In [64]:
import datetime
import ipywidgets as widgets
import mysql.connector as mysql
import pandas as pd

### let's connect to the database

In [193]:
con = mysql.connect(user = "db_2019", password = "db_2019db_2019db_2019", 
                    host = "localhost", database = "discourse_management")
cur = con.cursor(dictionary=True)

## SIMPLE SQL-python interface functions

### Utils

In [56]:
def protect(names):
    """
    protects values with `` on both sides (if it has ``, it reamis unchanged)
    
    :param names: list of str or str
    :return: list of stror str with `` around each str
    """
    
    if type(names) == str:
        if names.startswith('`') and names.endswith('`'):
            return names
        else:
            return f"`{names}`"
    elif type(names) == list or tuple:
        return [protect(value) for value in names]

In [53]:
protect('WHY')

'`WHY`'

In [54]:
protect('`WHY`')

'`WHY`'

In [55]:
protect(['I', 'do', '`hate`', 'programming!'])

['`I`', '`do`', '`hate`', '`programming!`']

SQL date should be passed in format YYYY-MM-DD, which is exactly str(datetime.date)

In [7]:
def str_values(values):
    """
    protects values for SQL (adds '' around strings, str other types)
    
    :param values: list
    :return: list of protected values separated by commas
    """
    return [f"'{value}'" if type(value) == str or datetime.date else str(value) for value in values]

In [8]:
str_values(['I', 'was', 'born on', datetime.date(1999, 12, 30), 'not on the', 1, 'st', 'of January'])

["'I'",
 "'was'",
 "'born on'",
 "'1999-12-30'",
 "'not on the'",
 "'1'",
 "'st'",
 "'of January'"]

### INSERT

In [182]:
def insert(data, table_name, column_names_dict):
    """
    inserts data into a database table
    
    :param data: list of lists of data
    :param table_name: str, table name
    :param column_names_dict: dict, keys - column names, values - int, ids inside data inner lists
    """
    columns, ids = list(zip(*list(column_names_dict.items())))
    columns = protect(columns)
    for datapoint in data:
        req = f"INSERT INTO {protect(table_name)} ({', '.join(columns)}) VALUES "
        values = str_values([datapoint[i] for i in ids])
        req += f"({', '.join(values)})"
        try:
            cur.execute(req)
            con.commit()
        except Exception as e:
            print(e)
            print(req)

In [179]:
data = [[1, 'yay', 'programming', str(datetime.date.today())], 
        [4, 'why', 'do i do this', str(datetime.date(2000, 12, 1))]]
column_names_dict = {'int_col':0, 'str_col':2, 'str_col2':1, 'date_col':3}
insert(data, 'example', column_names_dict)

**IT DID THE INSERT!!!**
You will see it below, when we select stuff from the table :)

### SELECT

In [168]:
"""SELECT DISTINCT author_entry.author_name FROM author_entry, text_entry WHERE 
author_entry.author_id = text_entry.author_id LIMIT 11, 5"""

"""SELECT db_2019.author_entry.gender, count(db_2019.author_entry.gender) AS cnt FROM db_2019.author_entry 
GROUP BY db_2019.author_entry.gender ORDER BY cnt DESC;"""

"""SELECT db_2019.author_entry.gender, count(db_2019.author_entry.gender) AS cnt FROM db_2019.author_entry 
GROUP BY db_2019.author_entry.gender HAVING cnt > 1;"""
def select(table_names, column_names='*', condition=None, distinct=False, limit=None, order=None, df=True, warn=True):
    """
    selects data from database tables on condition
    
    :param table_names: list of str, table names
    :param column_names: list of str, column names, optional, default '*'
    :param condition: str, condition on column names and values, optional, default None
    :param distinct: bool, whether to drop identical values, optional, default False
    :param limit: tuple (int, int) (begin from, limit by) 
                  or int, limit entries, optional, default None
    :param order: tuple (str, 'DESC'), (column_name to order by, wether to use descending order), 
                  or str column_name to order by, optional, default None
    :param df: bool, whetehr to return pandas or raw sql list of dicts, optional, default True
    :param warn: bool, whetehr to print if nothing was found, optional, default True
    
    :return: pd.DataFrame if df, else raw sql list of dicts
    """
    table_names_str = ', '.join(protect(table_names))
    if type(column_names) == list:
        column_names_str = ', '.join(protect(column_names))
    else:
        column_names_str = column_names
        
    if distinct:
        distinct = "DISTINCT"
    else:
        distinct = ""
    
    req = f"SELECT {distinct} {column_names_str} FROM {table_names_str}"
    
    if condition:
        req += f" WHERE {condition}"
    
    if type(order) == tuple:
        req += f"ORDER BY {protect(order[0])} {order[1]}"
    elif order:
        req += f"ORDER BY {protect(order)}"
    
    if type(limit) == tuple:
        req += f"LIMIT {', '.join(map(str, limit))}"
    elif type(limit) == int:
        req += f"LIMIT {limit}"

    try:
        cur.execute(req)
        res = cur.fetchall()
        if res:
            if df:
                return pd.DataFrame.from_records(res)
            else:
                return res
        elif warn:
            print('nothing was found for your request!')
    except Exception as e:
        print(f"got exception: {e}")
        print(f"your request: {req}")

**LET US TEST THIS MONSTER**

simple select

In [180]:
select(['example'])

   id_example  int_col       str_col str_col2    date_col
0           1      666          hell     hell  2001-01-01
1           2        1            oh       no  2019-12-24
2           3        0        please       no  1999-12-30
3          10        1            oh       no  2019-12-24
4          11        4        hurray      !!!  2000-01-01
5          12        1            oh       no  2019-12-24
6          13        4        hurray      !!!  2000-01-01
7          14        1   programming      yay  2019-12-25
8          15        4  do i do this      why  2000-12-01

on condition

In [122]:
select(['example'], condition='id_example < 3')

   id_example  int_col str_col str_col2    date_col
0           1       32    hell     hell  2001-01-01
1           2        1      oh       no  2019-12-24

on condition and columns

In [123]:
select(['example'], ['int_col', 'str_col2'], condition='id_example = 2 or id_example = 10')

   int_col str_col2
0        1       no
1        1       no

distinct

In [124]:
select(['example'], ['int_col', 'str_col2'], condition='id_example = 2 or id_example = 10', distinct=True)

   int_col str_col2
0        1       no

limit

In [125]:
select(['example'], limit=2)

   id_example  int_col str_col str_col2    date_col
0           1       32    hell     hell  2001-01-01
1           2        1      oh       no  2019-12-24

In [126]:
select(['example'], limit=(5,2))

   id_example  int_col str_col str_col2    date_col
0          12        1      oh       no  2019-12-24
1          13        4  hurray      !!!  2000-01-01

order by

In [130]:
select(['example'], order='int_col')

   id_example  int_col str_col str_col2    date_col
0           3        0  please       no  1999-12-30
1           2        1      oh       no  2019-12-24
2          10        1      oh       no  2019-12-24
3          12        1      oh       no  2019-12-24
4          11        4  hurray      !!!  2000-01-01
5          13        4  hurray      !!!  2000-01-01
6           1       32    hell     hell  2001-01-01

In [131]:
select(['example'], order=('int_col', 'DESC'))

   id_example  int_col str_col str_col2    date_col
0           1       32    hell     hell  2001-01-01
1          11        4  hurray      !!!  2000-01-01
2          13        4  hurray      !!!  2000-01-01
3           2        1      oh       no  2019-12-24
4          10        1      oh       no  2019-12-24
5          12        1      oh       no  2019-12-24
6           3        0  please       no  1999-12-30

warn

In [170]:
select(['example'], condition="str_col2 = 'jshfeshfhf'")

nothing was found for your request!

In [169]:
select(['example'], condition="str_col2 = 'jshfeshfhf'", warn=False)

**IT WORKS WITH REAL DATA TOO!**

In [19]:
select(['subjects', 'experiments', 'staff'], ['id_experiment', 'staff_surname', 'collection_date'], condition='subjects.id_subject = experiments.id_subject and experiments.id_staff_collected = staff.id_staff')

   id_experiment staff_surname collection_date
0              1     Рязанская      2019-01-20
1              2      Худякова      2019-03-18
2              3     Рязанская      2018-01-10
3              4      Худякова      2017-09-11
4              5     Рязанская      2019-05-22
5              6      Худякова      2017-11-23

In [20]:
select(['subjects', 'experiments', 'staff'], ['id_experiment', 'staff_surname', 'collection_date'], condition='subjects.id_subject = experiments.id_subject and experiments.id_staff_collected > 2')

Nothing was found for your request!

### UPDATE

In [65]:
"UPDATE `discourse_management`.`example` SET `str_col2` = 'yes' WHERE (`id_example` = '12');"
def update(table_name, column_names, values, condition):
    """
    changes one entry in a database table
    
    :param table_name: str, table name
    :param column_names: list of str, column names, 
    :param values: list, data to be changed
    :param condition: str of type "id_example = 1"
    """
    if len(column_names) != len(values):
        print(f"expected column_names and values of the same length, got {len(column_names)} and {len(values)}")
        return
    table_name = protect(table_name)
    column_names = protect(column_names)
    values = str_values(values)
    changes = [f"{column_names[i]} = {values[i]}" for i in range(len(column_names))]
    req = f"UPDATE {table_name} SET {', '.join(changes)} WHERE ({condition})"
    try:
        cur.execute(req)
        con.commit()
    except Exception as e:
        print(f"got exception: {e}")
        print(f"your request: {req}")

In [132]:
select(['example'], condition='id_example = 1')

   id_example  int_col str_col str_col2    date_col
0           1       32    hell     hell  2001-01-01

In [133]:
update('example', ['int_col', 'str_col2'], [666, 'hell'], "id_example = 1")

In [134]:
select(['example'], condition='id_example = 1')

   id_example  int_col str_col str_col2    date_col
0           1      666    hell     hell  2001-01-01

**OK, NICE, UPDATING WORKS**

In [25]:
def update_multiple(data, table_name, id_col_name, ids):
    """
    changes multiple entries in a database table (one by one)
    
    :param data: list of tuples (column_names - list of str and values - list of the same length)
    :param table_name: str, table name
    :param id_col_name: str, name of the primary key column in the table
    :param ids: list of int, ids in the primary key column of the values to be changed
    """
    if len(data) != len(ids):
        print(f"expected data and ids of the same length, got {len(data)} and {len(ids)}")
        return
    for i, line in enumerate(data):
        column_names, values = line
        update(table_name, column_names, values, f"{protect(id_col_name)} = '{ids[i]}'")

In [26]:
select(['example'], condition='id_example = 1 or id_example = 3')

   id_example  int_col  str_col str_col2    date_col
0           1       32  forever     hell  2001-01-01
1           3        0   please       no  2019-12-24

In [31]:
data = [(['int_col', 'str_col', 'str_col2'], [666, 'hell', 'forever']),
       (['date_col'], [datetime.date(1999, 12, 30)])]
ids = [1, 3]
update_multiple(data, 'example', 'id_example', ids)

In [32]:
select(['example'], condition='id_example = 1 or id_example = 3')

   id_example  int_col str_col str_col2    date_col
0           1      666    hell  forever  2001-01-01
1           3        0  please       no  1999-12-30

**NOW I CAN UPDATE MULTIPLE ROWS AT ONCE**

### DELETE

In [33]:
"DELETE FROM `discourse_management`.`subjects` WHERE (`id_subject` = '49')"
def delete(table_name, id_col_name, ids):
    """
    deletes entries in a database table (one by one)
    
    :param table_name: str, table name
    :param id_col_name: str, name of the primary key column in the table
    :param ids: list of int, ids in the primary key column of the entries to be deleted
    """
    for i in ids:
        req = f"DELETE FROM {protect(table_name)} WHERE ({protect(id_col_name)} = '{i}')"
        try:
            cur.execute(req)
            con.commit()
        except Exception as e:
            print(f"got exception: {e}")
            print(f"your request: {req}")

In [34]:
select(['example'])

   id_example  int_col str_col str_col2    date_col
0           1      666    hell  forever  2001-01-01
1           2        1      oh       no  2019-12-24
2           3        0  please       no  1999-12-30
3           8        1      oh       no  2019-12-24
4           9        4  hurray      !!!  2000-01-01

In [35]:
delete('example', 'id_example', [8, 9])

In [36]:
select(['example'])

   id_example  int_col str_col str_col2    date_col
0           1      666    hell  forever  2001-01-01
1           2        1      oh       no  2019-12-24
2           3        0  please       no  1999-12-30

### GET IDs on condition

In [171]:
def get_ids_on_condition(table_name, id_col_name, table_names, condition, distinct=True):
    """
    gets a list of ids satisfying some condition
    
    :param table_name: str, name of the table, from where to get ids
    :param id_col_name: str, name of the primary key column in the table
    :param table_names: list of str, table names
    :param condition: str, condition on column names and values
    :param distinct: bool, whether to drop identical values, optional, default True
    
    :return: list of int, ids of entries in the table, satisfying the condition
    """
    column_name = protect(table_name) + '.' + protect(id_col_name)
    dict_list = select(table_names, column_names=[column_name], 
                  condition=condition, distinct=distinct, df=False, warn=False)
    if dict_list:
        return [d[id_col_name] for d in dict_list]
    else:
        return []

In [172]:
select(["example"], condition="str_col2 = 'no'")

   id_example  int_col str_col str_col2    date_col
0           2        1      oh       no  2019-12-24
1           3        0  please       no  1999-12-30
2          10        1      oh       no  2019-12-24
3          12        1      oh       no  2019-12-24

In [173]:
get_ids_on_condition("example", "id_example", ["example"], "str_col2 = 'no'")

[2, 3, 10, 12]

In [174]:
get_ids_on_condition("example", "id_example", ["example"], "int_col = 10")

[]

**NOW I HAVE MOST OF WHAT I MIGHT NEED, RIGHT?**

### let us try to work with real CSV data

In [154]:
with open ('data\personal_aphasia.csv', 'r', encoding='utf-8-sig') as f:
    lines = f.readlines()

lines = [line.strip().split(';') for line in lines]
header = [x for x in lines[0] if x]
lines = [line[:len(header)] for line in lines[1:]]
lines = [[line[0]]+[line[1].lower()]+line[2:] for line in lines]
patient_data = pd.DataFrame.from_records(lines, columns=header)
patient_data.iloc[8:12,]

,ID,Sex,Age,Education,Aphasia type,Severity,Time post-onset,Etiology,Lesion location,Type
8,P19,f,67,higher,"sensory, acoustic-mnestic",moderate,2.5 y,CVA,lMCA,aphasia
9,P20,m,58,secondary,sensory,moderate,"1 y, 9 m",iCVA,lMCA,aphasia
10,P1,m,42,higher,,,,,,norm
11,P2,m,63,higher,,,,,,norm

In [38]:
select(['subjects'])

,id_subject,id_personal_info,language,language_comment,sex,handedness_type
0,25,DUMMY1,russian-mono,None,f,right
1,26,DUMMY2,russian-mono,None,m,left
2,27,DUMMY3,russian-bi,georgian,f,right
3,28,DUMMY4,russian-mono,None,m,right
4,50,P12,russian-mono,None,f,None

In [162]:
data = [lines[2][:2]+["russian-mono"]]
column_names_dict = {"id_personal_info":0, "sex":1, "language":2}
insert(data, "subjects", column_names_dict)

In [163]:
select(["subjects"])

,id_subject,id_personal_info,language,language_comment,sex,handedness_type
0,25,DUMMY1,russian-mono,None,f,right
1,26,DUMMY2,russian-mono,None,m,left
2,27,DUMMY3,russian-bi,georgian,f,right
3,28,DUMMY4,russian-mono,None,m,right
4,53,P13,russian-mono,None,m,None

**let's delete all, but dummy data**

In [142]:
get_ids_on_condition("subjects", "id_subject", ["subjects"], "id_personal_info NOT LIKE '%DUMMY%'")

[50, 52]

In [145]:
delete("subjects", "id_subject", get_ids_on_condition("subjects", "id_subject", ["subjects"], "id_personal_info NOT LIKE '%DUMMY%'"))

In [146]:
select(["subjects"])

,id_subject,id_personal_info,language,language_comment,sex,handedness_type
0,25,DUMMY1,russian-mono,None,f,right
1,26,DUMMY2,russian-mono,None,m,left
2,27,DUMMY3,russian-bi,georgian,f,right
3,28,DUMMY4,russian-mono,None,m,right

### now we can spread values into two tables, also ensuring unique values are unique

In [155]:
select(["subjects"], limit=2)

,id_subject,id_personal_info,language,language_comment,sex,handedness_type
0,25,DUMMY1,russian-mono,None,f,right
1,26,DUMMY2,russian-mono,None,m,left

In [197]:
select(["aphasia_diagnostic"])

,duration,primary_type,other_type,cause,id_experiment,id_cprin,lesion_location
0,73,sensory,acoustic-mnestic,trauma,2,107,lMCA
1,75,sensory,acoustic-mnestic,trauma,5,107,lMCA

from 
```['ID', 'Sex', 'Age', 'Education', 'Aphasia type', 'Severity', 'Time post-onset', 'Etiology', 'Lesion location', 'Type']```


```['ID', 'Sex']``` and ```['language'] # we assume 'russian mono'``` belong in __subjects__

```['Age', 'Education', 'Type']``` belongs in __experiments__

```['Aphasia type', 'Severity', 'Time post-onset', 'Etiology', 'Lesion location']``` belongs in __aphasia diagnostic__

for norm, we don't have such data

we will also have to assume the information about the experiment, since it is not given
only not-null data in __experiments__ are autoincrement **_id_experiment_**, **_id_project_**, **_id_subject_**, and **_subject_age_**

we will ignore education for now, because we don't have a conversion table

In [158]:
select(["experiments"], limit=2)

,id_experiment,id_project,id_subject,id_staff_collected,collection_date,subject_age,subject_education_years,id_subject_type,subject_neuro_impairment,subject_lang_impairment,subject_psych_impairment,subject_chronic_impairment,id_subject_education
0,1,1,25,1,2019-01-20,65,16,3,None,None,None,allergy,5
1,2,1,26,2,2019-03-18,70,20,1,stroke,None,None,hypertension,7

since it is aphasia project, let us assume **_project_id_** = 1 (RAT)

In [159]:
select(["projects"])

   id_project project_name
0           3        pears
1           1          RAT
2           2       schizo

In [161]:
select(["subject_types"])

   id_subject_type subject_type_name
0                1           aphasia
1                2            schizo
2                3              norm
3                4             tumor

**OK, let us take another look at the data**

In [213]:
patient_data.iloc[8:12,]

,ID,Sex,Age,Education,Aphasia type,Severity,Time post-onset,Etiology,Lesion location,Type
8,P19,f,67,higher,"sensory, acoustic-mnestic",moderate,2.5 y,CVA,lMCA,aphasia
9,P20,m,58,secondary,sensory,moderate,"1 y, 9 m",iCVA,lMCA,aphasia
10,P1,m,42,higher,,,,,,norm
11,P2,m,63,higher,,,,,,norm

In [208]:
select(["aphasia_diagnostic"])

,duration,primary_type,other_type,cause,id_experiment,id_cprin,lesion_location,severity
0,73,sensory,acoustic-mnestic,trauma,2,107,lMCA,severe
1,75,sensory,acoustic-mnestic,trauma,5,107,lMCA,moderate

**we will add things in the following order:**
1. check, if subject is already added (by **_id_personal_info_**), 
    1. if so -  retrieve **_subject_id_**
    2. else, add to **subjects**, and retrieve **_subject_id_**
2. add to **experiments** by **_subject_id_** with **_project_id_** = 1, retrieve **experiment_id**
3. if **id_subject_type** - aphasia (1), add to __aphasia diagnostic__

In [192]:
for line in lines:
    personal_id, sex, age, education_str, aphasia_type, aphasia_severity, time_post_onset, etiology, lesion_location, subject_type = line
    language = 'russian-mono'
    # check if in 'subjects'
    id_in_subjects = get_ids_on_condition("subjects", "id_subject", ["subjects"], 
                                          f"id_personal_info = '{personal_id}'")
    
    # insert into subjects if needed
    if not id_in_subjects:
        data = [[personal_id, sex, language]]
        column_names_dict = dict(zip(["id_personal_info", "sex", "language"], range(3)))
        insert(data, "subjects", column_names_dict)
    id_in_subjects = get_ids_on_condition("subjects", "id_subject", ["subjects"], 
                                          f"id_personal_info = '{personal_id}'")[0]
    
    # get subject_type_id (as they are the same in the CSV and SQL)
    subject_type_id = get_ids_on_condition("subject_types", "id_subject_type", ["subject_types"], 
                                           f"subject_type_name = '{subject_type}'")[0]
    
    # insert into 'experiments'
    data = [[1, id_in_subjects, age, subject_type_id]]
    column_names_dict = dict(zip(["id_project", "id_subject", "subject_age", "id_subject_type"], range(4)))
    insert(data, "experiments", column_names_dict)
    
    # insert into 'afasia_diagnostic' if subject_type = 'aphasia'
    if subject_type == 'aphasia':
        experiment_id = get_ids_on_condition("experiments", "id_experiment", ["experiments"], 
                                             f"id_subject = '{id_in_subjects}'")[-1]
        if ',' in time_post_onset: # '1 y, 9 m'
            y, m = time_post_onset.split(',')
            y = int(y.split()[0])
            m = int(m.split()[0])
            duration = m * 12 + m
        else: # '2.5 y'
            duration = float(time_post_onset.split()[0]) * 12
        
        if ',' in aphasia_type:
            primary, other = aphasia_type.split(',')
            data = [[experiment_id, duration, primary, other, etiology, lesion_location, aphasia_severity]]
            column_names_dict = dict(zip(["id_experiment", "duration", "primary_type", "other_type", 
                                      "cause", "lesion_location", "severity"], range(7)))
        else:
            primary = aphasia_type
            data = [[experiment_id, duration, primary, etiology, lesion_location, aphasia_severity]]
            column_names_dict = dict(zip(["id_experiment", "duration", "primary_type", 
                                          "cause", "lesion_location", "severity"], range(6)))

## ok, here's how widgets work

In [42]:
!jupyter nbextension enable --py widgetsnbextension

Enabling notebook extension jupyter-js-widgets/extension...
      - Validating: ok

In [43]:
style = {'description_width': 'initial'}

In [44]:
check = widgets.Checkbox(
        value=False,
        description='Check me',
        disabled=False)

dont = widgets.Checkbox(
        value=False,
        description='Do not check me',
        disabled=False)

ui = widgets.VBox([check, dont])

out = widgets.interactive_output(lambda a,b: print(a, b), {'a': check, 'b': dont})

display(ui)
out

VBox(children=(Checkbox(value=False, description='Check me'), Checkbox(value=False, description='Do not check …

Output()

In [45]:
options = ['Apples', 'Oranges', 'Pears']
widgets.interact(lambda x: print(x), x=widgets.SelectMultiple(
        options=options,
        value=['Oranges'],
        rows=len(options),
        description='Fruits: ',
        disabled=False));

interactive(children=(SelectMultiple(description='Fruits: ', index=(1,), options=('Apples', 'Oranges', 'Pears'…

In [46]:
widgets.interact(lambda x: print(x), x=widgets.RadioButtons(
        options=['pepperoni', 'pineapple', 'anchovies'],
        value='pineapple',
        description='Pizza topping:',
        disabled=False,
        style=style
    ));

interactive(children=(RadioButtons(description='Pizza topping:', index=1, options=('pepperoni', 'pineapple', '…

In [47]:
widgets.interact(lambda x: print(x), x=widgets.Dropdown(
        options=[('One', 1), ('Two', 2), ('Three', 3)],
        value=2,
        description='Number:',
    ));

interactive(children=(Dropdown(description='Number:', index=1, options=(('One', 1), ('Two', 2), ('Three', 3)),…